--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Day 1.log
  log type:  text
 opened on:  25 Nov 2019, 12:32:12

. summarize bp

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          bp |        169    101.2426    10.39261         80        133

. su bp

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          bp |        169    101.2426    10.39261         80        133

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   patientid |        189     4946386     2813740       7096    9931725
      gender |        188    1.606383    .4898561          1          2
        race |        188    1.441489    .9144017          1          4
         age |        188     31.6383    11.07664         16         55
   birthdate |          0
-------------+---------------------------------------------------------
     typhoid |        188    .0851064     .279785          0          1
   education |        189    2.259259    .8699972          1          4
     malaria |        189    2.179894    14.13045          0         98
          bp |        169    101.2426    10.39261         80        133
      height |        189    1.550899    .2951014        .79       2.37
-------------+---------------------------------------------------------
      weight |        189    77.67196    17.55957         38        120

. tab gender

  Gender of |
    Patient |      Freq.     Percent        Cum.
------------+-----------------------------------
       Male |         74       39.36       39.36
     Female |        114       60.64      100.00
------------+-----------------------------------
      Total |        188      100.00

. ta gender

  Gender of |
    Patient |      Freq.     Percent        Cum.
------------+-----------------------------------
       Male |         74       39.36       39.36
     Female |        114       60.64      100.00
------------+-----------------------------------
      Total |        188      100.00

. t gender
command t is unrecognized
r(199);

. ta gender

  Gender of |
    Patient |      Freq.     Percent        Cum.
------------+-----------------------------------
       Male |         74       39.36       39.36
     Female |        114       60.64      100.00
------------+-----------------------------------
      Total |        188      100.00

. ta ge

  Gender of |
    Patient |      Freq.     Percent        Cum.
------------+-----------------------------------
       Male |         74       39.36       39.36
     Female |        114       60.64      100.00
------------+-----------------------------------
      Total |        188      100.00

. ta edu

          education |      Freq.     Percent        Cum.
--------------------+-----------------------------------
    Primary or less |         39       20.63       20.63
     Some secondary |         76       40.21       60.85
Completed secondary |         60       31.75       92.59
           Tertiary |         14        7.41      100.00
--------------------+-----------------------------------
              Total |        189      100.00

. sum age if age > 40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |         43    48.37209    4.413309         41         55

. sum age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        188     31.6383    11.07664         16         55

. sum age, detail

                patient age at last birthday
-------------------------------------------------------------
      Percentiles      Smallest
 1%           16             16
 5%           17             16
10%           19             16       Obs                 188
25%           22             16       Sum of Wgt.         188

50%           29                      Mean            31.6383
                        Largest       Std. Dev.      11.07664
75%         39.5             54
90%           49             54       Variance        122.692
95%           53             55       Skewness       .5592734
99%           55             55       Kurtosis       2.175368

. browse

. des

Contains data from D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\GP da
> ta.dta
  obs:           189                          
 vars:            11                          1 Oct 2018 14:26
--------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------------------------------------
patientid       float   %9.0g                 patientid
gender          byte    %8.0g      sexx       Gender of Patient
race            byte    %9.0g      race       race group of patient
age             byte    %8.0g                 patient age at last birthday
birthdate       str10   %10s                  birthDate
typhoid         byte    %8.0g      ty         has typhoid
education       byte    %19.0g     ed         education
malaria         byte    %8.0g      ty         malaria
bp              int     %9.0g                 blood pressure
height          float   %9.0g                 height in metres
weight          float   %9.0g                 
--------------------------------------------------------------------------------------------------
Sorted by: gender

. cod
command cod is unrecognized
r(199);

. codebook

--------------------------------------------------------------------------------------------------
patientid                                                                                patientid
--------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [7096,9931725]               units:  1
         unique values:  189                      missing .:  0/189

                  mean:   4.9e+06
              std. dev:   2.8e+06

           percentiles:        10%       25%       50%       75%       90%
                           1.2e+06   2.8e+06   4.7e+06   7.5e+06   9.0e+06

--------------------------------------------------------------------------------------------------
gender                                                                           Gender of Patient
--------------------------------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  sexx

                 range:  [1,2]                        units:  1
         unique values:  2                        missing .:  1/189

            tabulation:  Freq.   Numeric  Label
                            74         1  Male
                           114         2  Female
                             1         .  

--------------------------------------------------------------------------------------------------
race                                                                         race group of patient
--------------------------------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  race

                 range:  [1,4]                        units:  1
         unique values:  4                        missing .:  1/189

            tabulation:  Freq.   Numeric  Label
                           145         1  Blacks
                            18         2  Whites
                            10         3  Asians
                            15         4  Coloureds
                             1         .  

--------------------------------------------------------------------------------------------------
age                                                                   patient age at last birthday
--------------------------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [16,55]                      units:  1
         unique values:  40                       missing .:  1/189

                  mean:   31.6383
              std. dev:   11.0766

           percentiles:        10%       25%       50%       75%       90%
                                19        22        29      39.5        49

--------------------------------------------------------------------------------------------------
birthdate                                                                                birthDate
--------------------------------------------------------------------------------------------------

                  type:  string (str10)

         unique values:  180                      missing "":  2/189

              examples:  "05-08-1972"
                         "12-01-1963"
                         "17-09-1989"
                         "25-02-1959"

--------------------------------------------------------------------------------------------------
typhoid                                                                                has typhoid
--------------------------------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  ty

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  1/189

            tabulation:  Freq.   Numeric  Label
                           172         0  No
                            16         1  Yes
                             1         .  

--------------------------------------------------------------------------------------------------
education                                                                                education
--------------------------------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  ed

                 range:  [1,4]                        units:  1
         unique values:  4                        missing .:  0/189

            tabulation:  Freq.   Numeric  Label
                            39         1  Primary or less
                            76         2  Some secondary
                            60         3  Completed secondary
                            14         4  Tertiary

--------------------------------------------------------------------------------------------------
malaria                                                                                    malaria
--------------------------------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  ty, but 1 nonmissing value is not labeled

                 range:  [0,98]                       units:  1
         unique values:  3                        missing .:  0/189

            tabulation:  Freq.   Numeric  Label
                           165         0  No
                            20         1  Yes
                             4        98  

--------------------------------------------------------------------------------------------------
bp                                                                                  blood pressure
--------------------------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [80,133]                     units:  1
         unique values:  32                       missing .:  20/189

                  mean:   101.243
              std. dev:   10.3926

           percentiles:        10%       25%       50%       75%       90%
                                88        94       103       108       114

--------------------------------------------------------------------------------------------------
height                                                                            height in metres
--------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [.79,2.37]                   units:  .01
         unique values:  38                       missing .:  0/189

                  mean:    1.5509
              std. dev:   .295101

           percentiles:        10%       25%       50%       75%       90%
                              1.21      1.37      1.52      1.79      1.89

--------------------------------------------------------------------------------------------------
weight                                                                                 (unlabeled)
--------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [38,120]                     units:  1
         unique values:  41                       missing .:  0/189

                  mean:    77.672
              std. dev:   17.5596

           percentiles:        10%       25%       50%       75%       90%
                                54        66        76        90       100

. race
command race is unrecognized
r(199);

. edu
command edu is unrecognized
r(199);

. education
command education is unrecognized
r(199);

. des edu

              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------------------------------------
education       byte    %19.0g     ed         education

. edu, nolabel
command edu is unrecognized
r(199);

. rename edu as 'educ'
syntax error
    Syntax is
        rename  oldname    newname   [, renumber[(#)] addnumber[(#)] sort ...]
        rename (oldnames) (newnames) [, renumber[(#)] addnumber[(#)] sort ...]
        rename  oldnames              , {upper|lower|proper}
r(198);

. rename education as 'educ'
syntax error
    Syntax is
        rename  oldname    newname   [, renumber[(#)] addnumber[(#)] sort ...]
        rename (oldnames) (newnames) [, renumber[(#)] addnumber[(#)] sort ...]
        rename  oldnames              , {upper|lower|proper}
r(198);

. rename education as "educa"
syntax error
    Syntax is
        rename  oldname    newname   [, renumber[(#)] addnumber[(#)] sort ...]
        rename (oldnames) (newnames) [, renumber[(#)] addnumber[(#)] sort ...]
        rename  oldnames              , {upper|lower|proper}
r(198);

. rename education "educa"
"educa invalid name
r(198);

. rename education educ

. label variable educa "schooliing"
variable educa not found
r(111);

. label var educa "Schoooling"
variable educa not found
r(111);

. label var educa "schooling"
variable educa not found
r(111);

. label var educ "schooling"

. label define educarelabel 1 "Grade 6" 2 "Grade 10" 3 "Grace 12" 4 "First year"

. label values educ educarelabel

. tab  educ

  schooling |      Freq.     Percent        Cum.
------------+-----------------------------------
    Grade 6 |         39       20.63       20.63
   Grade 10 |         76       40.21       60.85
   Grace 12 |         60       31.75       92.59
 First year |         14        7.41      100.00
------------+-----------------------------------
      Total |        189      100.00

. drop weight malaria

. tab malaria
variable malaria not found
r(111);

. tab weight
variable weight not found
r(111);

. cls

. clear

. use "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\GP data.dta"

. cls

. gen age2=age
(1 missing value generated)

. gen bmi = weight/(height*height)

. tab bmi

        bmi |      Freq.     Percent        Cum.
------------+-----------------------------------
   8.535298 |          1        0.53        0.53
   9.433751 |          1        0.53        1.06
   10.68205 |          1        0.53        1.59
   11.03812 |          1        0.53        2.12
   11.75025 |          1        0.53        2.65
   11.81474 |          2        1.06        3.70
   13.47679 |          1        0.53        4.23
   13.58696 |          1        0.53        4.76
   13.88666 |          1        0.53        5.29
    14.6092 |          1        0.53        5.82
   14.95845 |          2        1.06        6.88
   15.32127 |          1        0.53        7.41
   15.72292 |          1        0.53        7.94
   15.77909 |          1        0.53        8.47
   16.17215 |          2        1.06        9.52
   16.30506 |          1        0.53       10.05
   16.79684 |          1        0.53       10.58
   17.13138 |          1        0.53       11.11
   17.96905 |          1        0.53       11.64
   18.31285 |          1        0.53       12.17
   18.72601 |          2        1.06       13.23
   18.87386 |          1        0.53       13.76
   18.90359 |          1        0.53       14.29
   19.03642 |          2        1.06       15.34
    19.4458 |          1        0.53       15.87
   19.59632 |          1        0.53       16.40
   19.65545 |          1        0.53       16.93
   20.02884 |          1        0.53       17.46
   20.08507 |          1        0.53       17.99
   20.52892 |          1        0.53       18.52
   21.03725 |          1        0.53       19.05
   21.08282 |          1        0.53       19.58
   21.56286 |          1        0.53       20.11
   21.70513 |          1        0.53       20.63
   21.92613 |          1        0.53       21.16
   21.96786 |          1        0.53       21.69
   23.03875 |          1        0.53       22.22
   23.51558 |          1        0.53       22.75
   23.62029 |          1        0.53       23.28
   23.91883 |          1        0.53       23.81
   24.25867 |          1        0.53       24.34
   24.83576 |          1        0.53       24.87
   24.89706 |          1        0.53       25.40
   25.10388 |          1        0.53       25.93
   25.29938 |          1        0.53       26.46
    25.4017 |          2        1.06       27.51
   25.91513 |          1        0.53       28.04
   25.99244 |          1        0.53       28.57
   26.14269 |          1        0.53       29.10
   26.63967 |          1        0.53       29.63
   26.88095 |          1        0.53       30.16
    27.4653 |          1        0.53       30.69
   27.54821 |          1        0.53       31.22
   27.63606 |          1        0.53       31.75
   28.04038 |          1        0.53       32.28
   28.67263 |          1        0.53       32.80
   28.69175 |          1        0.53       33.33
   28.69605 |          1        0.53       33.86
   28.72738 |          1        0.53       34.39
   28.77085 |          1        0.53       34.92
   28.84153 |          1        0.53       35.45
   28.98201 |          1        0.53       35.98
   29.33741 |          1        0.53       36.51
   29.64268 |          1        0.53       37.04
   29.67442 |          1        0.53       37.57
   29.72839 |          1        0.53       38.10
   29.76191 |          1        0.53       38.62
   29.83643 |          1        0.53       39.15
   30.29778 |          2        1.06       40.21
   30.47052 |          1        0.53       40.74
   30.48316 |          1        0.53       41.27
   30.54283 |          2        1.06       42.33
    30.7574 |          1        0.53       42.86
     30.854 |          1        0.53       43.39
   31.16343 |          1        0.53       43.92
   31.20257 |          1        0.53       44.44
   31.21748 |          1        0.53       44.97
   31.46837 |          1        0.53       45.50
   32.02837 |          1        0.53       46.03
   32.04588 |          1        0.53       46.56
   32.04615 |          2        1.06       47.62
   32.27542 |          1        0.53       48.15
   32.43097 |          1        0.53       48.68
   32.78465 |          1        0.53       49.21
   33.19608 |          1        0.53       49.74
   33.30898 |          1        0.53       50.26
   33.64845 |          1        0.53       50.79
   34.01361 |          1        0.53       51.32
   34.17489 |          1        0.53       51.85
     34.375 |          1        0.53       52.38
    34.4496 |          1        0.53       52.91
   34.57582 |          1        0.53       53.44
   34.72088 |          1        0.53       53.97
   35.11124 |          1        0.53       54.50
   35.17053 |          2        1.06       55.56
   35.40039 |          1        0.53       56.08
   35.49169 |          1        0.53       56.61
    35.9375 |          1        0.53       57.14
   35.99633 |          1        0.53       57.67
   36.09607 |          1        0.53       58.20
   36.22995 |          2        1.06       59.26
   36.26244 |          1        0.53       59.79
   36.57979 |          1        0.53       60.32
   36.75698 |          2        1.06       61.38
   36.82782 |          1        0.53       61.90
   37.22299 |          1        0.53       62.43
   37.29554 |          1        0.53       62.96
   37.83613 |          1        0.53       63.49
   37.94715 |          3        1.59       65.08
   37.94907 |          1        0.53       65.61
   38.36113 |          1        0.53       66.14
   38.79238 |          2        1.06       67.20
   38.87269 |          1        0.53       67.72
   39.79823 |          1        0.53       68.25
    40.2832 |          1        0.53       68.78
   41.32232 |          1        0.53       69.31
   41.55789 |          1        0.53       69.84
   41.64931 |          2        1.06       70.90
   42.00798 |          1        0.53       71.43
   42.62347 |          1        0.53       71.96
   43.68906 |          1        0.53       72.49
   43.94532 |          1        0.53       73.02
   44.14215 |          1        0.53       73.54
   44.22477 |          1        0.53       74.07
   44.34292 |          1        0.53       74.60
   44.75465 |          2        1.06       75.66
   45.35147 |          1        0.53       76.19
   45.35148 |          1        0.53       76.72
   45.53888 |          1        0.53       77.25
   46.20878 |          1        0.53       77.78
   46.27701 |          1        0.53       78.31
   47.93388 |          1        0.53       78.84
   47.95141 |          2        1.06       79.89
   49.01699 |          1        0.53       80.42
   49.88019 |          1        0.53       80.95
   50.08258 |          1        0.53       81.48
   50.12139 |          1        0.53       82.01
   51.90902 |          3        1.59       83.60
   52.02914 |          1        0.53       84.13
   53.32986 |          1        0.53       84.66
   53.68134 |          1        0.53       85.19
   55.09641 |          1        0.53       85.71
   55.42958 |          1        0.53       86.24
   55.93132 |          1        0.53       86.77
   56.15235 |          1        0.53       87.30
   57.23205 |          1        0.53       87.83
   57.37313 |          2        1.06       88.89
   58.04989 |          2        1.06       89.95
   58.47953 |          1        0.53       90.48
   60.58673 |          1        0.53       91.01
   60.73845 |          1        0.53       91.53
   61.80404 |          1        0.53       92.06
   62.43496 |          1        0.53       92.59
   62.65173 |          1        0.53       93.12
   66.33715 |          1        0.53       93.65
   67.12019 |          1        0.53       94.18
   68.52996 |          1        0.53       94.71
   68.93425 |          1        0.53       95.24
   75.58579 |          1        0.53       95.77
   76.74297 |          1        0.53       96.30
   78.00454 |          1        0.53       96.83
    78.0437 |          1        0.53       97.35
     78.125 |          1        0.53       97.88
   81.63266 |          1        0.53       98.41
   83.10249 |          1        0.53       98.94
   90.90909 |          1        0.53       99.47
   147.4123 |          1        0.53      100.00
------------+-----------------------------------
      Total |        189      100.00

. brows height weight

. browse height weight bmi if bmi > 40

. list height weight

     +-----------------+
     | height   weight |
     |-----------------|
  1. |   1.58       62 |
  2. |   1.52       86 |
  3. |   1.21       84 |
  4. |   1.37      116 |
  5. |   1.49       66 |
     |-----------------|
  6. |   1.24      102 |
  7. |    1.1      110 |
  8. |   1.37       84 |
  9. |   1.47       62 |
 10. |   1.95       62 |
     |-----------------|
 11. |   1.77       76 |
 12. |   2.37       62 |
 13. |   1.58       86 |
 14. |   1.54       82 |
 15. |   1.37       90 |
     |-----------------|
 16. |   1.58       80 |
 17. |   1.79       60 |
 18. |   1.21       76 |
 19. |   1.47      100 |
 20. |   1.77      110 |
     |-----------------|
 21. |   1.84       46 |
 22. |    1.1       58 |
 23. |   1.84       58 |
 24. |   1.24       82 |
 25. |   1.77       68 |
     |-----------------|
 26. |   1.43      102 |
 27. |   1.65       84 |
 28. |   1.86       76 |
 29. |   2.11       72 |
 30. |   1.61       62 |
     |-----------------|
 31. |   1.32       96 |
 32. |   1.82       68 |
 33. |   1.87       66 |
 34. |   1.61       90 |
 35. |   1.89       68 |
     |-----------------|
 36. |    1.9       54 |
 37. |   1.54       92 |
 38. |   1.38       70 |
 39. |   1.47       86 |
 40. |   1.21       84 |
     |-----------------|
 41. |   1.58       50 |
 42. |   1.32       48 |
 43. |   2.37       78 |
 44. |   1.47       98 |
 45. |   1.05       86 |
     |-----------------|
 46. |   1.52       58 |
 47. |   1.37       70 |
 48. |   1.28       72 |
 49. |   1.24      118 |
 50. |   1.37       90 |
     |-----------------|
 51. |    1.6       92 |
 52. |   1.68       96 |
 53. |    .79       92 |
 54. |   1.37       68 |
 55. |   1.37      114 |
     |-----------------|
 56. |   1.38       80 |
 57. |   2.11       80 |
 58. |   1.24       68 |
 59. |   1.12       76 |
 60. |   1.21       76 |
     |-----------------|
 61. |   2.11       72 |
 62. |   1.58       80 |
 63. |   2.11       96 |
 64. |   1.37       56 |
 65. |   1.62       96 |
     |-----------------|
 66. |   1.58       72 |
 67. |   1.13       80 |
 68. |   1.85       94 |
 69. |   1.47       76 |
 70. |   2.11       38 |
     |-----------------|
 71. |   1.47       82 |
 72. |   1.21       76 |
 73. |   1.49       72 |
 74. |   1.24       86 |
 75. |   1.54      108 |
     |-----------------|
 76. |   1.85       50 |
 77. |   1.68       84 |
 78. |   1.14      108 |
 79. |   1.24       96 |
 80. |   1.37       72 |
     |-----------------|
 81. |   1.49       98 |
 82. |   2.11       42 |
 83. |   1.47       90 |
 84. |   1.43       66 |
 85. |    1.6       88 |
     |-----------------|
 86. |   1.37       68 |
 87. |   1.54       90 |
 88. |   1.54       86 |
 89. |   1.52       82 |
 90. |   1.13       64 |
     |-----------------|
 91. |   1.84       88 |
 92. |   1.84       86 |
 93. |   1.68       86 |
 94. |   1.26      120 |
 95. |   1.32       50 |
     |-----------------|
 96. |   1.84       86 |
 97. |   1.84       40 |
 98. |   1.79       94 |
 99. |   1.62       80 |
100. |   1.85      114 |
     |-----------------|
101. |   1.54       92 |
102. |   2.37       60 |
103. |   1.82       96 |
104. |   1.49       84 |
105. |   1.05       74 |
     |-----------------|
106. |   1.21       48 |
107. |   1.58       70 |
108. |   1.14       76 |
109. |   1.84       64 |
110. |   1.38       88 |
     |-----------------|
111. |   1.84       62 |
112. |   1.47       56 |
113. |   1.58       74 |
114. |   1.38       70 |
115. |   1.05       76 |
     |-----------------|
116. |   2.11       60 |
117. |   1.37       82 |
118. |   1.37       54 |
119. |   1.89       84 |
120. |   1.87       94 |
     |-----------------|
121. |   1.95       60 |
122. |   1.68       78 |
123. |   1.47      116 |
124. |   1.85       72 |
125. |   1.47       90 |
     |-----------------|
126. |   1.54       50 |
127. |   1.22      102 |
128. |   1.24       80 |
129. |   1.77       48 |
130. |   1.89       68 |
     |-----------------|
131. |   1.24       88 |
132. |   1.47       84 |
133. |   1.65       98 |
134. |   1.37       94 |
135. |   1.87       68 |
     |-----------------|
136. |   1.37       50 |
137. |   1.79       60 |
138. |   1.28       66 |
139. |   1.52       72 |
140. |   1.53       80 |
     |-----------------|
141. |   1.47       68 |
142. |   1.47       76 |
143. |   1.58       84 |
144. |   1.54       62 |
145. |   1.47       82 |
     |-----------------|
146. |   1.26       88 |
147. |   1.05       64 |
148. |   1.89      106 |
149. |   1.54       52 |
150. |   1.87      112 |
     |-----------------|
151. |   1.89       60 |
152. |   1.12       98 |
153. |   1.47       78 |
154. |   1.28       92 |
155. |   1.52       70 |
     |-----------------|
156. |   1.05       64 |
157. |   1.54       74 |
158. |   1.37       78 |
159. |   1.05       90 |
160. |   1.24       48 |
     |-----------------|
161. |   1.77       74 |
162. |   1.37       84 |
163. |   1.47       66 |
164. |   1.54       98 |
165. |   1.22       66 |
     |-----------------|
166. |   1.77       90 |
167. |   1.28       58 |
168. |   1.37       80 |
169. |   1.47       66 |
170. |   1.54       68 |
     |-----------------|
171. |   1.77      104 |
172. |    1.9       54 |
173. |   1.47       82 |
174. |   2.37       66 |
175. |   1.05       50 |
     |-----------------|
176. |   1.54       60 |
177. |   2.11       70 |
178. |   1.77       78 |
179. |   1.84       68 |
180. |   1.84       78 |
     |-----------------|
181. |   1.86       68 |
182. |   1.53       72 |
183. |   1.52       70 |
184. |   1.37       92 |
185. |   1.89       70 |
     |-----------------|
186. |   1.79      118 |
187. |   1.84       40 |
188. |   1.54       76 |
189. |   1.24      120 |
     +-----------------+

. browse

. list patientid height weight bmi if bmi > 40

     +---------------------------------------+
     | patien~d   height   weight        bmi |
     |---------------------------------------|
  3. |   532115     1.21       84   57.37313 |
  4. |  2769887     1.37      116   61.80404 |
  6. |  6826784     1.24      102   66.33715 |
  7. |  2978492      1.1      110   90.90909 |
  8. |  4200598     1.37       84   44.75465 |
     |---------------------------------------|
 15. |  2587192     1.37       90   47.95141 |
 18. |  5227694     1.21       76   51.90902 |
 19. |  8181495     1.47      100   46.27701 |
 22. |  4069878      1.1       58   47.93388 |
 24. |  9785737     1.24       82   53.32986 |
     |---------------------------------------|
 26. |  7312884     1.43      102   49.88019 |
 31. |  3835811     1.32       96   55.09641 |
 40. |  7122591     1.21       84   57.37313 |
 44. |  3736455     1.47       98   45.35147 |
 45. |  7743317     1.05       86   78.00454 |
     |---------------------------------------|
 48. |  5425137     1.28       72   43.94532 |
 49. |  9906347     1.24      118   76.74297 |
 50. |  3498876     1.37       90   47.95141 |
 53. |  3229692      .79       92   147.4123 |
 55. |  2686450     1.37      114   60.73845 |
     |---------------------------------------|
 56. |  9221656     1.38       80   42.00798 |
 58. |  7657751     1.24       68   44.22477 |
 59. |  8774827     1.12       76   60.58673 |
 60. |  1094441     1.21       76   51.90902 |
 67. |  2906715     1.13       80   62.65173 |
     |---------------------------------------|
 72. |  2363238     1.21       76   51.90902 |
 74. |  5971938     1.24       86   55.93132 |
 75. |  3468722     1.54      108   45.53888 |
 78. |   541920     1.14      108   83.10249 |
 79. |  7083473     1.24       96   62.43496 |
     |---------------------------------------|
 81. |   950579     1.49       98   44.14215 |
 83. |  5137952     1.47       90   41.64931 |
 90. |  2869576     1.13       64   50.12139 |
 94. |  1744188     1.26      120   75.58579 |
105. |  1790560     1.05       74   67.12019 |
     |---------------------------------------|
108. |  9757362     1.14       76   58.47953 |
110. |  3924872     1.38       88   46.20878 |
115. |  3850074     1.05       76   68.93425 |
117. |  3412785     1.37       82   43.68906 |
123. |  5497093     1.47      116   53.68134 |
     |---------------------------------------|
125. |  6286678     1.47       90   41.64931 |
127. |  1569127     1.22      102   68.52996 |
128. |   942231     1.24       80   52.02914 |
131. |  5409711     1.24       88   57.23205 |
134. |  8208097     1.37       94   50.08258 |
     |---------------------------------------|
138. |  3851896     1.28       66    40.2832 |
146. |   396565     1.26       88   55.42958 |
147. |  6745197     1.05       64   58.04989 |
152. |  7531580     1.12       98     78.125 |
154. |  6802818     1.28       92   56.15235 |
     |---------------------------------------|
156. |  9543575     1.05       64   58.04989 |
158. |  7960923     1.37       78   41.55789 |
159. |  3739588     1.05       90   81.63266 |
162. |  5653156     1.37       84   44.75465 |
164. |  6125947     1.54       98   41.32232 |
     |---------------------------------------|
165. |  8318740     1.22       66   44.34292 |
168. |  8593978     1.37       80   42.62347 |
175. |  3085052     1.05       50   45.35148 |
184. |  3197473     1.37       92   49.01699 |
189. |  4400766     1.24      120    78.0437 |
     +---------------------------------------+

. cls

. list patientid height weight bmi if bmi > 40

     +---------------------------------------+
     | patien~d   height   weight        bmi |
     |---------------------------------------|
  3. |   532115     1.21       84   57.37313 |
  4. |  2769887     1.37      116   61.80404 |
  6. |  6826784     1.24      102   66.33715 |
  7. |  2978492      1.1      110   90.90909 |
  8. |  4200598     1.37       84   44.75465 |
     |---------------------------------------|
 15. |  2587192     1.37       90   47.95141 |
 18. |  5227694     1.21       76   51.90902 |
 19. |  8181495     1.47      100   46.27701 |
 22. |  4069878      1.1       58   47.93388 |
 24. |  9785737     1.24       82   53.32986 |
     |---------------------------------------|
 26. |  7312884     1.43      102   49.88019 |
 31. |  3835811     1.32       96   55.09641 |
 40. |  7122591     1.21       84   57.37313 |
 44. |  3736455     1.47       98   45.35147 |
 45. |  7743317     1.05       86   78.00454 |
     |---------------------------------------|
 48. |  5425137     1.28       72   43.94532 |
 49. |  9906347     1.24      118   76.74297 |
 50. |  3498876     1.37       90   47.95141 |
 53. |  3229692      .79       92   147.4123 |
 55. |  2686450     1.37      114   60.73845 |
     |---------------------------------------|
 56. |  9221656     1.38       80   42.00798 |
 58. |  7657751     1.24       68   44.22477 |
 59. |  8774827     1.12       76   60.58673 |
 60. |  1094441     1.21       76   51.90902 |
 67. |  2906715     1.13       80   62.65173 |
     |---------------------------------------|
 72. |  2363238     1.21       76   51.90902 |
 74. |  5971938     1.24       86   55.93132 |
 75. |  3468722     1.54      108   45.53888 |
 78. |   541920     1.14      108   83.10249 |
 79. |  7083473     1.24       96   62.43496 |
     |---------------------------------------|
 81. |   950579     1.49       98   44.14215 |
 83. |  5137952     1.47       90   41.64931 |
 90. |  2869576     1.13       64   50.12139 |
 94. |  1744188     1.26      120   75.58579 |
105. |  1790560     1.05       74   67.12019 |
     |---------------------------------------|
108. |  9757362     1.14       76   58.47953 |
110. |  3924872     1.38       88   46.20878 |
115. |  3850074     1.05       76   68.93425 |
117. |  3412785     1.37       82   43.68906 |
123. |  5497093     1.47      116   53.68134 |
     |---------------------------------------|
125. |  6286678     1.47       90   41.64931 |
127. |  1569127     1.22      102   68.52996 |
128. |   942231     1.24       80   52.02914 |
131. |  5409711     1.24       88   57.23205 |
134. |  8208097     1.37       94   50.08258 |
     |---------------------------------------|
138. |  3851896     1.28       66    40.2832 |
146. |   396565     1.26       88   55.42958 |
147. |  6745197     1.05       64   58.04989 |
152. |  7531580     1.12       98     78.125 |
154. |  6802818     1.28       92   56.15235 |
     |---------------------------------------|
156. |  9543575     1.05       64   58.04989 |
158. |  7960923     1.37       78   41.55789 |
159. |  3739588     1.05       90   81.63266 |
162. |  5653156     1.37       84   44.75465 |
164. |  6125947     1.54       98   41.32232 |
     |---------------------------------------|
165. |  8318740     1.22       66   44.34292 |
168. |  8593978     1.37       80   42.62347 |
175. |  3085052     1.05       50   45.35148 |
184. |  3197473     1.37       92   49.01699 |
189. |  4400766     1.24      120    78.0437 |
     +---------------------------------------+

. cleawr
command cleawr is unrecognized
r(199);

. clear

. use "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Firstwave.dta"

. use "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Secondwave.dta"

. clear

. use "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Secondwave.dta"

. clea
command clea is unrecognized
r(199);

. clear

. use "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Firstwave.dta"

. append using "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Secondwa
> ve.dta"

. clear

. use "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Risk factors.dta"

. browse

. clear

. use "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Health data.dta"

. clear

. use "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Risk factors.dta"

. merge 1:1 id using "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\He
> alth data.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                22  (_merge==3)
    -----------------------------------------

. browse

. clear

. import excel "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Week 1.x
> lsx", sheet("week 1") firstrow case(lower)
(8 vars, 144 obs)

. save "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Week 1.dta"
file D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Week 1.dta saved

. tab  antenatalvisit

Antenatalvi |
        sit |      Freq.     Percent        Cum.
------------+-----------------------------------
      False |        127       88.19       88.19
       True |         17       11.81      100.00
------------+-----------------------------------
      Total |        144      100.00

. clear

. import excel "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Week 2.x
> lsx", sheet("Week 2") firstrow case(lower)
(8 vars, 123 obs)

. tab  antenatalvisit

Antenatalvi |
        sit |      Freq.     Percent        Cum.
------------+-----------------------------------
      False |         98       79.67       79.67
       True |         25       20.33      100.00
------------+-----------------------------------
      Total |        123      100.00

. save "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Week 2.dta"
file D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Week 2.dta saved

. clear

. use "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Week 1.dta"

. append using "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Week 2.d
> ta"

. tab  antenatalvisit

Antenatalvi |
        sit |      Freq.     Percent        Cum.
------------+-----------------------------------
      False |        225       84.27       84.27
       True |         42       15.73      100.00
------------+-----------------------------------
      Total |        267      100.00

. clear

. use "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Child data.dta"

. clear

. use "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets Stata\Maternal data.dta
> "

. merge 1:1 uniqueid using "D:\One Drive\OneDrive - University of South Africa\Desktop\Datasets St
> ata\Child data.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             4
        from master                         2  (_merge==1)
        from using                          2  (_merge==2)

    matched                                36  (_merge==3)
    -----------------------------------------

. browse

. browse if _merge==1

. browse if _merge<3

. browse if _merge!=3

. exit, clear
